Здесь описаны основные возможности/функции работы с удалёнными репозиториями

Удалённые репозитории - репозитории, которые загружены на гитхаб (или любой другой сервис работы с репозиториями)

1. Прежде всего должен быть аккуаунт на гитхабе
2. git clone "link" Чтобы скачать реппоизторий на локальный компьютер и копируем ссылку на репозиторий,который хотим скачать

Репозиторий копируется на локальный компьютер

3.Мы вносим необходимые изменения,сохраняем,затем чтобы загрузить новые данные используются последовательно следующие команды:

4. git remote add origin (название) https://github.com/Shakhnoz95/gitlesson3.git (ссылка куда всё будет загружаться)
5. git branch -M main (создаёт ветку, где будут внесённые изменения)
6. git push -u origin main (загружается инф-ция в созданную ветку)

Данные могут вноситься и в самом гитхабе (необязательно скачивать и работать с локального компьютера)
Чтобы загрузить новые данные, внесённые в гитхабе или с другого компьютера/аккаунта, используется команда: 

7. git pull - не только скачивает реппозитории с сервиса,но и мержит (объединяет ветки\одинаковые данные)

8. Можно скопировать себе чужой репозиторий с помощью fork (вилка)
в гитхабе при загрузке репозиториев гитхаб сам проверяет что есть разница, 
предлагает добавить комментарий при добавлении изменений в чужой реппозитори в отдельной ветке (форке),
 чтобы автор/владелец изначального репозитория рассмотрел новые предложения 